[
  {
    "path": "posts/2021-02-19-datavizmakeover2/",
    "title": "DataVizMakeover2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Yolanda Zhang",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\n1 Critiques of Data Visualisation\r\na. Clarity\r\n\r\n\r\nSN\r\n\r\n\r\nComments\r\n\r\n\r\n1\r\n\r\n\r\nThe colors of each categorical level in the stacked bar chart representing the attitude towards vaccine are not set properly. A diverging palette should be used for variables with a meaningful order type.\r\n\r\n\r\n2\r\n\r\n\r\nThe scale of the stacked bar chart representing the attitude towards vaccine is not set properly. For easy comparison, the zero point should be set at the middle of the categorical level that represents the moderate attitude of comments.\r\n\r\n\r\n3\r\n\r\n\r\nFor the scatter plot chart, the percentage of strongly agree itself can not provide us a full view on which country is more pro-vaccine. We might also want to know how this result based on sample values could be projected to the population.\r\n\r\n\r\n4\r\n\r\n\r\nFor easy comparison, the order of how the countries is represented in these two charts should be the same.\r\n\r\n\r\n5\r\n\r\n\r\nTo get actionable insights, in addition to a general understanding of which country is more pro-vaccine, we might want to figure out reasons behind this attitude.\r\n\r\n\r\nb. Aesthetic\r\n\r\n\r\nSN\r\n\r\n\r\nComments\r\n\r\n\r\n1\r\n\r\n\r\nWhat we would like to show the users at the first glance is an intuitive visual display of which country is more pro-vaccine. A scatter plot with error bar is more suitable for this task and should be more ye catching.\r\n\r\n\r\n2\r\n\r\n\r\nThe legend title ”vac 1” has no meaning. Actually, we do not need a legend title.\r\n\r\n\r\n3\r\n\r\n\r\nThe legend of the stacked bar chart is too far away and is not nicely presented.\r\n\r\n\r\n4\r\n\r\n\r\nScale of the x-axis of the two charts are not synchronized with inconsistent x-axis labels across the two charts. The x-axis labels for the left chart is shown as whole number while the right chart us shown to 1 decimal place.\r\n\r\n\r\n5\r\n\r\n\r\nSince we can easily recognise the y aixs of the two charts arrange countries, a field label is not needed.\r\n\r\n\r\n1.1 Ways to improve current design\r\na. Clarity\r\n\r\n\r\nComments\r\n\r\n\r\nSuggestedImprovement\r\n\r\n\r\nThe colors of each categorical level in the stacked bar chart representing the attitude towards vaccine are not set properly. A diverging palette should be used for variables with a meaningful order type.\r\n\r\n\r\nA diverging palette should be used for a variable showing the degree of support for vaccines.\r\n\r\n\r\nThe scale of the stacked bar chart representing the attitude towards vaccine is not set properly. For easy comparison, A zero point should be set at the middle of the categorical level that represents the moderate attitude of comments.\r\n\r\n\r\nA zero point should be set at the middle of the “3” categorical level, since it represents the medium degree of support for vaccine among the five.\r\n\r\n\r\nThe percentage of strongly agree itself can not illustrate what we are aiming to figure out—which country is more pro-vaccine.\r\n\r\n\r\nError bars should be added to the scatter plot to represent probability of agree with confidence interval.\r\n\r\n\r\nFor easy comparison, the order of how the countries is represented should be the same.\r\n\r\n\r\nOrder the countries of these two charts similarly.\r\n\r\n\r\nTo get actionable insights, in addition to a general understanding of which country is more pro-vaccine, we might want to figure out reasons behind this attitude.\r\n\r\n\r\nAdd additional charts depicting other fields to allow readers to deep dive further into the survey results and figure out reasons behind this attitude.\r\n\r\n\r\nb. Aesthetic\r\n\r\n\r\nComments\r\n\r\n\r\nSuggestedImprovement\r\n\r\n\r\nWhat we would like to show the users at the first glance is an intuitive visual display of which country is more pro-vaccine. A scatter plot with error bar is more suitable for this task and should be more ye catching.\r\n\r\n\r\nMake the stacked bar chart showing on the left of the stacked bar chart and the portions of the stacked bar chart highlighted based on the country selected in the scatter plot chart.\r\n\r\n\r\nThe legend title ”vac 1” has no meaning. Actually, we do not need a legend title.\r\n\r\n\r\nUnshown the legend.\r\n\r\n\r\nThe legend of the stacked bar chart is too far away and is not nicely presented.\r\n\r\n\r\nPlace the legend adjacent to the stacked bar chart and edit the aliases so that it indicates the support degree to vaccine.\r\n\r\n\r\nInconsistent x-axis labels across the two charts, where the x-axis labels for the left chart is shown as whole number while the right chart us shown to 1 decimal place.\r\n\r\n\r\nSynchronised the scale of the two charts and standardised the decimal places across all the axis.\r\n\r\n\r\nSince we can easily recognise the y aixs of the two charts arrange countries, a field label is not needed\r\n\r\n\r\nRemove the field label.\r\n\r\n\r\n2 Sketch of Proposed Design\r\n\r\n\r\n\r\nWork done: Add error bars into the scatter plot showing the percentage of people that will take vaccine. Add the parameter “confidence level” to allow user select the confidence level they would like to accept. Sorted country in all the charts by probability of positive attitude to vaccine. Synchronize the axis of the charts. Set the color of the stacked bar chart properly. Add interactive action to allow user manipulate the visualization. a) By default, the “infection expectation” and “consequence expectation” charts will not show. It will only show when the user say that he would like to learn more. b) Country(s) will be highlighted in the stacked bar chart if user select the particular country or hover around the particular country in the scatter plot showing the percentage of people that will take vaccine.\r\n3 Preparing Process\r\n3.1 Data Preparation\r\nSince the data have many field that are not useful for the analytics purpose, delete the extra columns.\r\n\r\n\r\n\r\nAdd data sources to tableau\r\nSince each country’s data comprises a separate csv file, keep all the files in a single folder and then connect one of them to tableau, all the files within the folder will show on the files field. We need to remove the file imported first and then double click “new union”, drag all the files into the union creating field.\r\n\r\n\r\n\r\n\r\n\r\n\r\nThen your data source would look like below. We would have only one file that is the union file and a column called table name are automatically generated. In this case, we use it to indicate the country. Right click the header of each column to rename and edit aliases of that measure.\r\n\r\n\r\n\r\n\r\n\r\n\r\n3.2 Create the scatter plot chart with error bar\r\nWe are going to check the probability of positive attitude and its lower and higher confidence interval.\r\nFirst of all, we are going to create a parameter to indicate the confidence level we would like to accept. Click the small triangle in the data field of our sheet, we can create parameters. Set the datatype to be “string” and allowable values to be list and input the value of the list in the list editing field.\r\n\r\n\r\n\r\n\r\n\r\n\r\nAfter that, we need to create a calculation field called Z that identify the z value of different confidence levels.\r\n\r\n\r\n\r\nThen we are able to calculate the probability of positive views and the error bar. Six calculation fields are need here.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nWith these calculation fields, we are able to draw our scatter plots now. We drag measure values to columns and country to rows. For the measure values, we only need the CI_lower and CI_higher. Then we drag ProbabilityPositiveView into the graph. Then we under the “measure values”mark, we set the graph pattern to line and measure values as the path variable. As the last step, we set sort country descendingly by ProbabilityPsotiveView.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n3.3 Create the stacked barchart\r\nWe are going to calculate the starting point of each level of attitude toward vaccine and let the length of them to be their percentage over the total observation.\r\nSix calculation fields needed here.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n3.4 Create the dashboard\r\nDrag the individual graph into the area wanted Add the actions that allow user to manipulate the data visualization. Three actions need here. One is filter action that filter out all value of the infection and consequence charts. Values in these two charts will only show when user selected the country in the AttitudeVACC chart. The other two highlight action will highlight the countries selected or hovered around in the Attitude VACC chart.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n4.0 Conclusion\r\nThe five most_pro_vaccine countries show a negative relationship between attitude to vaccine and infection expectation; The five least_pro_vaccine countries show a positive relationship between attitude to vaccine and infection expectation.\r\nTwo great leaps of consequence expectation could be observed at the third and nineth most_pro_vaccine countries. Which means if we divided the countries into three groups based on attitude toward vaccine, in the group level, consequence expectation and attitude toward vaccine relates negatively—those are more likely to get the vaccine believe that they have a higher probability of bad consequence if infected. Within each group, however, those are more likely to get the vaccine believe that they have a less probability of bad consequence if infected.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-19-datavizmakeover2/1.jpg",
    "last_modified": "2021-02-20T19:41:27+08:00",
    "input_file": "datavizmakeover2.utf8.md"
  },
  {
    "path": "posts/2021-01-28-vizmakeover1/",
    "title": "VizMakeover1",
    "description": "A data visualisation on labour force, Singapore",
    "author": [
      {
        "name": "Yolanda Zhang",
        "url": {}
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\n1.0 Critiques of Data Visualisation\r\nThe Purpose of this visualisation is not conveyed well in the chart. For a period of time from 2009-2019, we aim to show the rise in median age of residents in the labour force and the change in share of the residents labour force for residents age groups “25-54” and ”55&over”. In addition, to look into the causes of this change, changes of LFPR and population are investigated to explain the above changes we have detected and we also want to show those changes.\r\n1.1 Clarity\r\n\r\n\r\nSN\r\n\r\n\r\nComments\r\n\r\n\r\n1\r\n\r\n\r\nThe title is not clear enough as it does not point out what exact aspect(s) of labour force it would represent. Instead of saying “Residents Labour Force by Age”, “Meidan Age of Labourforce and Share of Each Age Group” would be better.\r\n\r\n\r\n2\r\n\r\n\r\nThe age group are not divided properly. Too many age groups are shown in the chart that will distract user attention. We only need three age groups: ”15-24”, “25-54” and ”55&over” to focus user attention.\r\n\r\n\r\n3\r\n\r\n\r\nThe chart only shows the change in share of the residents labour force. To look into the causes of this change, we also want to show changes of LFPR and population.\r\n\r\n\r\n4\r\n\r\n\r\nThe chart does not have a y axis to show what the lines represents, the units and scales.\r\n\r\n\r\n1.2 Aesthetic\r\n\r\n\r\nSN\r\n\r\n\r\nComments\r\n\r\n\r\n1\r\n\r\n\r\nAs a visualization aims to show numbers in charts and represent then in a more organized and understandable way, we are not supposed to have a table in it.\r\n\r\n\r\n2\r\n\r\n\r\nBar charts should be used represent discrete values instead of lines.\r\n\r\n\r\n3\r\n\r\n\r\nx-axis does not need a tick values as it represents the age group which has a categorical scale.\r\n\r\n\r\n1.3 Ways to improve current design\r\n1.3.1 Clarity\r\n\r\n\r\nComments\r\n\r\n\r\nSuggestedImprovement\r\n\r\n\r\nThe title is not clear enough as it does not point out what exact aspect(s) of labour force it would represent. Instead of saying “Residents Labour Force by Age”, “Meidan Age of Labourforce and Share of Each Age Group” would be better.\r\n\r\n\r\nSet the title to be “Median Age of Labourforce and Share of Each Age Group”.\r\n\r\n\r\nThe age group are not divided properly. Too many age groups are shown in the chart that will distract user attention. We only need three age groups: ”15-24”, “25-54” and ”55&over” to focus user attention.\r\n\r\n\r\nGrouped all the measures into three age groups: ”15-24”, “25-54” and ”55&over”\r\n\r\n\r\nThe chart only shows the change in share of the residents labour force. To look into the causes of this change, we also want to show changes of LFPR and population.\r\n\r\n\r\nIntegrated another two charts showing change of LFPR and population throughout the period from 2009 to 2019 for age group “25-54” and “55&over”\r\n\r\n\r\nThe chart does not have a y axis to show what the lines represents, the units and scales.\r\n\r\n\r\nDo set y axis properly\r\n\r\n\r\n1.3.2 Aesthetic\r\n\r\n\r\nComments\r\n\r\n\r\nSuggestedImprovement\r\n\r\n\r\nAs a visualization aims to show numbers in charts and represent then in a more organized and understandable way, we are not supposed to have a table in it.\r\n\r\n\r\nRemoved the table and reorganized the dashboard. The main part of the dashboard will consist of three graphs: Graph A: A graph combing a bar chart showing the share of labour force in the three age ranges and a line showing the median la bour force age for year 2009 and year 2019. Graph B: A graph showing the change of LFPR and population share of residents aged 25-54 throughout the period from 2009 to 2019. Graph C: A graph showing the change of LFPR and population share of residents aged 55 and over throughout the period from 2009 to 2019.\r\n\r\n\r\nBar charts should be used represent discrete values instead of lines.\r\n\r\n\r\nUse bar chart to show the share of labour force of different age groups.”\r\n\r\n\r\nx-axis does not need a tick values as it represents the age group which has a categorical scale.\r\n\r\n\r\nRemove the tick values.\r\n\r\n\r\n2.0 Sketch of Proposed Design\r\n\r\n\r\n\r\n3.0 Preparing Process\r\n3.1 Data Preparation\r\nOriginally, we have the absolute number of labour force and labour force participation rate by age group in a format as following. The columns represent different years and the rows represent different age range.\r\n\r\n\r\n\r\n\r\n\r\n\r\nWe need to pivot them so that they represent similar to our population table—a column for year, a column for age and a column for our measure.\r\n\r\n\r\n\r\nTableau prep builder was used in this stage. We connect the original files to prep builder and choose “pivot” under the plus icon that represents the process we want to execute. After that, we say we want to pivot columns to rows and drag the columns one by one to the pivot values area and save the result tables.\r\n\r\n\r\n\r\n\r\n\r\n\r\n3.2 Add data sources to tableau\r\nWe connect the result tables (and the population table) to tableau and then drag the relevant sheets to the relationship generation area. We say the relationship is age=age and year=year.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n3.3 Add data sources to tableau\r\nUsing the function under “analysis” in menu, we are now able to create calculation fields we need. We want to have LFPR, proportion in population and market share of the three age groups.\r\n\r\n\r\n\r\n3.3.1 Example Formula for LFPR\r\nWe have LFPR of smaller age groups than expected, so we want to calculate the weighted average LFPR of residents for each of the three age groups.\r\n\r\n\r\n\r\n3.3.2 Example formula for market share\r\nWe have absolute number of labour force in smaller age groups than expected, so we calculate the proportion of labour force falling in each of the three age groups\r\n\r\n\r\n\r\n3.3.3 Example formula for proportion in population\r\n\r\n\r\n\r\n3.4 Export summary data and add it back to tableau\r\nThe next step is to create a line(discrete) sheet that have year and measure names in columns and measure values in rows, putting the nine calculation fields we have into measure values.\r\n\r\n\r\n\r\nThen export the sheets under analysis-view data\r\n\r\n\r\n\r\nThen add the summary sheet back to tableau together with the median age sheet.\r\n\r\n\r\n\r\n3.5 Formulate graphs\r\nNow we can draw the graphs we want to have in our dashboard. We say that we want to have a scatter plots under show me and we want to have market share and median age in columns and year and age range in rows (note that the order matters here because we want to group the values by age range for each year) Then we change the graph type to be bar for market share and to be line for median age. We say we want to set the color of the graphs by measure names\r\n\r\n\r\n\r\nTo look into the causes of the changes in median age and market share of labour force of different age groups, we also want to have two more charts showing change of LFPR and population throughout the period from 2009 to 2019for age group “25-54” and “55&over” We say that we want to have a scatter plots under show me and we want to have year in columns and LFPR,25-54 and Population,25-54 in rows. We only need observations for year 2009 and 2019, so we create a filter using year and filter out the years that we do not need.\r\n\r\n\r\n\r\n3.6 Integrate the graphs in a dashboard\r\n\r\n\r\n\r\n4.0 Insights gained\r\nShare of labour force aged 55 and over increased from 2009 to 2019.\r\nShare of labour force aged 25-54 declined from 2009 to 2019.\r\nTogether, those two phenomena have resulted in an increase in median age of labour force.\r\nThe increasing LFPR of residents aged 55 and over together with their proportion in the population have caused their increased share in the labour force.\r\nShare of labour force aged 25-54 declined even as their LFPR increased due to their decreasing proportion in population\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-28-vizmakeover1/scratch.png",
    "last_modified": "2021-02-20T19:01:04+08:00",
    "input_file": "vizmakeover1.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-fist-post/",
    "title": "My Fist Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Yolanda Zhang",
        "url": {}
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-fist-post/my-fist-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-28T15:23:58+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Yolanda Zhang",
        "url": {}
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T15:12:13+08:00",
    "input_file": {}
  }
]
